



{
  mongo $DB_CONNECTION_STRING
  cd nd.userto.com
}

// Cmd -> Running putty with login and password
{
  cd C:\Program Files\PuTTY\ && putty.exe c3550@h4.netangels.ru -pw twdqfiwk98 && cd C:\Data\Dev\
  // putty.exe -load h2.netangels.ru -l c3550 -pw twdqfiwk98
  // putty.exe c3550@h2.netangels.ru -pw twdqfiwk98
  // 84QTet6oqPiA YeMmoDacnibex39   twdqfiwk98
}


//- - - 🚀- - - ✂ - - - ⚽ - - - ⚓ - - - ⚘ - - - ☴ - - - ⚷ - - - ⩩ - - - ★ - - - ☒ - - - ₽ - - - ✂ - - - ❤ - - - ✔ - - - ● - - - ★


//  Remove directory recurcevely -f, -r, -v
//  https://askubuntu.com/questions/217893/how-to-delete-a-non-empty-directory-in-terminal
    rm -r node_modules

//  Show disk space taken
    du -hs ./* | sort -rh | head


//- - - 🚀- - - ✂ - - - ⚽ - - - ⚓ - - - ⚘ - - - ☴ - - - ⚷ - - - ⩩ - - - ★ - - - ☒ - - - ₽ - - - ✂ - - - ❤ - - - ✔ - - - ● - - - ★

/**
 * @description Responce from netAngels.com
 */

/*
  Здравствуйте, Круглов Александр Александрович (u53393)
  По договору u53393 в контейнере облачного хостинга c3550 (Мои сайты) Вы создали сайт nd.userto.com.

  Сайт nd.userto.com настроен для работы с node.js версии v11.14.0. В папке /home/c3550/nd.userto.com развернута инсталляция node.js (npm), в которую Вы можете установить необходимые Вам пакеты посредством команды npm, например:

  cd /home/c3550/nd.userto.com
  npm install
  Исходные коды Вашего приложения мы рекомендуем разместить в папке /home/c3550/nd.userto.com/app. Статические файлы следует размещать в папке www, в этом случае они будут раздаваться посетителям средствами веб-сервера и эта операция не будет создавать нагрузку на Ваше приложение.

  В случае, если Вам потребуется перезапустить сервер с Вашим приложением, это можно сделать в панели управления в разделе настроек Node.js, либо выполнив в консоли в папке /home/c3550/nd.userto.com команду touch reload.

  Изменить версию и настройки Node.js приложения можно в панели управления хостингом в разделе Node.js Вашего сайта.

  Также мы подготовили для Вас подробные инструкции по работе с Node.js для Облачного хостинга.

  Реквизиты подключения к MongoDB для сайта nd.userto.com:

  Логин: c3550_nd_userto_com
  Пароль: JaBdoDifgowun32
  База данных: c3550_nd_userto_com
  Адрес кластера MongoDB: mongo1.c3550.h2,mongo2.c3550.h2,mongo3.c3550.h2
  При подключении к кластеру необходимо указать в настройках доп.параметр replicaSet=MongoReplica
  Для подключения к MongoDB в вашем коде можно использовать переменную окружения DB_CONNECTION_STRING:

  DB_CONNECTION_STRING="mongodb://c3550_nd_userto_com:JaBdoDifgowun32@mongo1.c3550.h2,mongo2.c3550.h2,mongo3.c3550.h2/c3550_nd_userto_com?replicaSet=MongoReplica"
  Значение этой переменной уже установлено в окружении вашего сайта.

  Если Вам потребуется создать дополнительные базы данных для этого сайта, пожалуйста, воспользуйтесь разделом панели управления.

  Реквизиты доступа к сайту nd.userto.com по FTP:

  Логин: c3550_nd_userto_com
  Пароль: CuRteQeslobuw46
  Хост: h4.netangels.ru
  Прямая ссылка для входа по ftp: ftp://c3550_nd_userto_com:CuRteQeslobuw46@h4.netangels.ru
  Также рекомендуем воспользоваться Файловым Менеджером для более удобной работы с файлами Вашего сайта.

*/
